УТ.РасширениеКонтурЛогистика/src/Documents/КонтурЛогистика_СВ_ТитулГП/КонтурЛогистика_СВ_ТитулГП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_СВ_ТитулГП</name>
  <posting>Deny</posting>
  <attributes>
    <name>ТипТитула</name>
    <comment>один из 5 титулов перевозчика сопроводительной ведомости</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СВ</name>
    <comment>Уникальный идентификатор документа сопроводительной ведомости</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭППВ</name>
    <comment>Электронная подпись файла обмена информации перевозчика о приеме груза</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ТранспортнаяНакладная</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.КонтурЛогистика_Вспомогательный</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСВ</name>
    <comment>Главный документ для СВ</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфПрв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфГП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфГП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомИспр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрПодВыгр</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрВозврКонт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоВыгрузки</name>
    <comment>Адрес места выгрузки контейнера из ТС</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТСПриб</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПВыгр</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТСУбыт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СВФСостКонт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МасГрузБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МасГрузНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
      <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
      <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
      <types>CatalogRef.Валюты</types>
      <types>EnumRef.КонтурЛогистика_МастерДанныеСотрудников</types>
      <types>CatalogRef.Контрагенты</types>
      <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
      <types>Boolean</types>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
      <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
      <types>CatalogRef.Организации</types>
      <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
      <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
      <types>String</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.Партнеры</types>
      <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>EnumRef.КонтурЛогистика_ВариантыВалидации</types>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
      <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
      <types>CatalogRef.ЗоныДоставки</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контейнеры</name>
    <comment>необязательный блок</comment>
    <attributes>
      <name>ДатВрСдПгр</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатВрВозврКонт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРазТипКонт</name>
      <comment>Заполняется согласно правилам нумерации кодов размеров и типов контейнеров из раздела 4.2 ГОСТ Р 52524-2019 (ИСО 6346:1995)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтКодСтр</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрузПодКонт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаКонт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрТаблПломб</name>
      <comment>Наличие таблички, подтверждающей возможность работы под пломбами в соответствии с Международной конвенцией по безопасным контейнерам (КБК)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомКонтейн</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Documents/КонтурЛогистика_СВ_ТитулГП/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаСВ(Данные, Представление, СтандартнаяОбработка);

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов(ТипДокумента = Неопределено) Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул6 Тогда 
		// выгружаем груженый контейнер из ТС
		МассивОбязательных.Добавить("МестоВыгрузки");
		МассивОбязательных.Добавить("ДатВрПодВыгр");
	ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул8 Тогда 
		// погружаем груженый контейнер на ТС
		МассивОбязательных.Добавить("ДатВрВозврКонт");
	КонецЕсли;
	
	МассивОбязательных.Добавить("ДатаТСПриб");
	МассивОбязательных.Добавить("ДатаПВыгр");
	МассивОбязательных.Добавить("ДатаТСУбыт");
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции


Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_СВ");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("ДокументСВ");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфГП");
	МассивКлючевых.Добавить("ВрИнфГП");
	
	МассивКлючевых.Добавить("ЭППВ");
	МассивКлючевых.Добавить("ИдФайлИнфПрв");
	МассивКлючевых.Добавить("ДатФайлИнфПрв");
	МассивКлючевых.Добавить("ВрФайлИнфПрв");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

// Конец Обязательные манифесты

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументСВ = Объект.ДокументСВ;
	
	Если НЕ ЗначениеЗаполнено(ДокументСВ)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной сопроводительной ведомости";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументСВ", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		ОбязательныеРеквизитыГлавного = Документы.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыГлавного Цикл
			Если НЕ ЗначениеЗаполнено(ДокументСВ[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной сопроводительной ведомости";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		Документы.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость.ПроверитьКлючевыеРеквизитыСВ(ДокументСВ, ТаблицаОшибок);

	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов(Объект.ТипТитула) Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_СВ_ТитулГП.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_СВ_ТитулГП.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли
